## Excel a Pandas
 1. Datos con nombre de columna y en la primera hoja
 2. Datos no están en la primera hoja
 3. No hay nombres de columnas

## Punto 0

In [1]:
## importar pandas 
import pandas as pd

In [2]:
# extraer ruta del archivo 
path = 'datos_rrss.xlsx'

## Punto 1

In [3]:
# datos completos en la priemra hoja
pd.read_excel(path)

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
2  Instragram      1000    True  2010
3     YouTube      2000   False  2005
4    LinkedIn       663   False  2003
5    WhatsApp      1600    True  2009

In [4]:
# los datos no están en la primera hoja
pd.read_excel(path, 
             sheet_name= 'Hoja2' )

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
2  Instragram      1000    True  2010

In [5]:
# sin nombres de columnas
pd.read_excel(path, 
             sheet_name= 'Hoja3',
             header = None,
             names = ['Nombre', 'Cantidad', 'ES_FBK', 'Año'])

       Nombre  Cantidad  ES_FBK   Año
0    Facebook      2449    True  2006
1     Twitter       339   False  2006
2  Instragram      1000    True  2010
3     YouTube      2000   False  2005
4    LinkedIn       663   False  2003
5    WhatsApp      1600    True  2009